j20-immigration/content/post/disrupt-fed-funds.md
+++
title = "Won't a sanctuary law disrupt the flow of federal funds to Hawai`i?"
author = ["Hawaii J20"]
date = 2018-06-23T11:10:00-10:00
lastmod = 2018-08-04T18:04:08-10:00
draft = false
[menu.main]
  weight = 2010
  identifier = "won-t-a-sanctuary-law-disrupt-the-flow-of-federal-funds-to-hawai-i"
+++

## Question: {#question}

If Hawaii refuses to cooperate with Trump and his immigration
policies, he will retaliate by withholding federal grants to Hawaii. Why should
Hawai\`i unnecessarily put hundreds of millions of federal dollars at risk?


## Background: {#background}

Actually, very little federal funding would be at risk, because federal law
allows grant moneys to be withheld only when a state does not comply with the
requirements of that particular grant.  The [federal government must take care
not to coerce states](https://www.everycrsreport.com/reports/R44797.html#%5FToc478130447) by withholding funds.

There is only one federal grant related to law enforcement, the [Edward Byrne
Memorial Justice Assistance Grant (JAG) Program](https://www.bja.gov/jag/). Hawaii receives a relatively
small amount from the Byrne JAG program. [Hawaii's allocation for FY 2017 was
$840,284.00](https://www.bja.gov/Programs/JAG/jag17/17HI.pdf). Of this total, the Department of Attorney General will receive
$504,170.40 and $336,113.60 will be directly awarded to the counties. The state
portion of the Byrne JAG grant represents 0.6% of the Department of Attorney
General's operating budget.

The Federal Department of Justice (DOJ) under Attorney General Sessions has
attempted to attach [conditions to the Byrne JAG grant](https://www.justice.gov/opa/pr/attorney-general-sessions-announces-immigration-compliance-requirements-edward-byrne-memorial). These conditions seek to
expand state and local government requirements to cooperate with the federal
government in its efforts to enforce federal immigration laws. In September,
2017 a [federal judge in Chicago granted a nationwide injunction](https://www.clearinghouse.net/detail.php?id=16080) against these
conditions, holding that it was likely AG Sessions had exceeded his authority by
imposing them.

It should be noted that, despite Hawaii’s high-profile challenge to Trump’s
Muslim travel ban, the federal budget proposed by Trump would actually increase
total federal funding for Hawaii.


## Answer: {#answer}

The federal government is barred by law from coercing states in this way. The
Trump administration might threaten to withhold funds, but such a threat would
be a bully's bluster. In any event, the amount of federal funding in question is
not great. It represents less than 1% of the State Attorney General's annual
budget.
